dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/IOMUX_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="IOMUX" HW_revision="1.0">
    <register id="IOMUX_PINCM" width="32" offset="0x4" instances="251" instaddr="0x4" description="Pin Control Management Register in SECCFG region">
        <bitfield id="PF" description="Peripheral Function selection bits" begin="5" end="0" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Reserved as unconnected"/>
            <bitenum id="MAXIMUM" value="0x3F" description="An encoding per function that can be connected to this pin."/>
        </bitfield>
        <bitfield id="PC" description="Peripheral is Connected" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="UNCONNECTED" value="0x0" description="The output of the peripheral (and its output enable) will not propagate to the IOCELL"/>
            <bitenum id="CONNECTED" value="0x1" description="The output latch of the dataflow will be transparent"/>
        </bitfield>
        <bitfield id="WAKESTAT" description="This has the IOPAD WAKEUP signal as status bit." begin="13" end="13" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="wakeup source is NOT from this IOCELL"/>
            <bitenum id="ENABLE" value="0x1" description="wakeup source is from this IOCELL"/>
        </bitfield>
        <bitfield id="PIPD" description="Pull Down control selection" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Pull down is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="Pull down is enabled"/>
        </bitfield>
        <bitfield id="PIPU" description="Pull Up control selection" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Pull up is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="Pull up is enabled"/>
        </bitfield>
        <bitfield id="INENA" description="Input Enable Control Selection" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Input enable is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="Input enable is enabled."/>
        </bitfield>
        <bitfield id="HYSTEN" description="Hysteresis Enable Control Selection" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="hysteresis is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="hysteresis is enabled"/>
        </bitfield>
        <bitfield id="DRV" description="Drive strength control selection, for HS IOCELL only" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="DRVVAL0" value="0x0" description="Drive setting of 0 selected"/>
            <bitenum id="DRVVAL1" value="0x1" description="Drive setting of 1 selected"/>
        </bitfield>
        <bitfield id="HIZ1" description="High output value will tri-state the output when this bit is enabled" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="open-drain is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="open-drain is enabled."/>
        </bitfield>
        <bitfield id="WUEN" description="Wakeup Enable bit" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="wakeup is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="wakeup is enabled"/>
        </bitfield>
        <bitfield id="WCOMP" description="Wakeup Compare Value bit" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="MATCH0" value="0x0" description="Wakeup on a match of 0"/>
            <bitenum id="MATCH1" value="0x1" description="Wakeup on a match of 1"/>
        </bitfield>
        <bitfield id="INV" description="Data inversion selection" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Data inversion is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="Data inversion is enabled"/>
        </bitfield>
    </register>

</module>